In [1]:
import pandas as pd

df = pd.read_csv("employees.csv")
df.head()

   emp_id     name department  salary  experience
0     101    Alice         HR   60000           3
1     103      Bob         IT   80000           5
2     102  Charlie    Finance   70000           4
3     105    David         IT   90000           7
4     104      Eva         HR   65000           3

##### Rank salaries (highest = rank 1)

In [15]:
df['salary_rank']=df['salary'].rank(ascending=False)
df.head()

   emp_id     name department  salary  experience  salary_rank
0     101    Alice         HR   60000           3          5.0
1     103      Bob         IT   80000           5          2.0
2     102  Charlie    Finance   70000           4          3.0
3     105    David         IT   90000           7          1.0
4     104      Eva         HR   65000           3          4.0

##### rank(method ='average')

In [19]:
df["rank_average"] = df["experience"].rank(method="average")
df["rank_min"] = df["experience"].rank(method="min")
df["rank_dense"] = df["experience"].rank(method="dense")

df

,emp_id,name,department,salary,experience,salary_rank,rank_average,rank_min,rank_dense
0,101,Alice,HR,60000,3,5.0,1.5,1.0,1.0
1,103,Bob,IT,80000,5,2.0,4.0,4.0,3.0
2,102,Charlie,Finance,70000,4,3.0,3.0,3.0,2.0
3,105,David,IT,90000,7,1.0,5.0,5.0,4.0
4,104,Eva,HR,65000,3,4.0,1.5,1.0,1.0